<details>

<summary>Terraform plan</summary>

```
Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.waf will be created
  + resource "aws_cloudwatch_metric_alarm" "waf" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + alarm_name                            = "azul-waf-daniel"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Region" = "us-east-1"
          + "Rule"   = "ALL"
          + "WebACL" = "azul-api_gateway-daniel"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "BlockedRequests"
      + namespace                             = "AWS/WAFV2"
      + ok_actions                            = [
          + "arn:aws:sns:us-east-1:122796619775:azul-monitoring-dev",
        ]
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "Name"       = "azul-waf-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-waf"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + tags_all                              = {
          + "Name"       = "azul-waf-daniel"
          + "billing"    = "hca"
          + "component"  = "azul-waf"
          + "deployment" = "daniel"
          + "owner"      = "dsotirho@ucsc.edu"
          + "service"    = "azul"
        }
      + threshold                             = 1500
      + treat_missing_data                    = "notBreaching"
    }
```

</details>


## Blocked requests (sum over 5 minutes)

### Personal deployments:
![waf-personal](https://github.com/DataBiosphere/azul/assets/46407464/46071846-341f-4003-bb61-36e3b8420b00)

### dev:
![waf-dev](https://github.com/DataBiosphere/azul/assets/46407464/4772f6ab-223f-4d49-80b4-ef1e0bc914ee)

### anvildev:
![waf-anvildev](https://github.com/DataBiosphere/azul/assets/46407464/71036083-3dcf-4423-bf5c-a17637204585)

### sandbox:
![waf-sandbox](https://github.com/DataBiosphere/azul/assets/46407464/097b8c91-c6f7-464e-9076-cb2111286131)

### anvilbox:
![waf-anvilbox](https://github.com/DataBiosphere/azul/assets/46407464/3db72ba6-5395-41d7-8172-d03bb7d11caa)

### hammerbox:
![waf-hammerbox](https://github.com/DataBiosphere/azul/assets/46407464/f4d0d4bc-1fd3-432f-9566-50ee9fc656b7)

### prod:
(Image omitted for security purposes)
Max value: 5,192
Common spike: 1,000 - 3,000

### anvilprod:
(Image omitted for security purposes)
Max value: 8,928
Common spike: 500 - 1,000
